Table of Contents
 Class RebarHookBend
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Represents a bend rebar hook in 3D.
public class RebarHookBend : RebarHookBase
Inheritance
object
OpenObject
RebarHookBase
RebarHookBend
Inherited Members
 RebarHookBase.AxisY
 RebarHookBase.Reverse
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Angle
Bending Angle in X-Y Plane.
public double Angle { get; set; }
Property Value
double
 Length
Length of the Hook.
public double Length { get; set; }
Property Value
double
 Radius
Bending Radius. It will override Vertex Radius in case of RebarArcRadVertex3D and RebarArcRadVertex3D.
public double Radius { get; set; }
Property Value
double
 Edit this page